data/old/rand-readers-cil-ucontext-20130909153337.log
Linux rhodium 3.10.9.wheezymptcp #14 SMP Thu Aug 29 23:29:00 UTC 2013 x86_64 GNU/Linux
testbedhdd.img: QEMU QCOW Image (v2), 5368709120 bytes
Guest backend: cil-ucontext
fio --name=rand-readers --rw=randread --bs=32k --runtime=30 --time_based --size=100m --numjobs=10
Host:
rand-readers: (g=0): rw=randread, bs=32K-32K/32K-32K/32K-32K, ioengine=sync, iodepth=1
...
rand-readers: (g=0): rw=randread, bs=32K-32K/32K-32K/32K-32K, ioengine=sync, iodepth=1
fio-2.1.1
Starting 10 processes
rand-readers: Laying out IO file(s) (1 file(s) / 100MB)
rand-readers: Laying out IO file(s) (1 file(s) / 100MB)
rand-readers: Laying out IO file(s) (1 file(s) / 100MB)
[...]

rand-readers: (groupid=0, jobs=1): err= 0: pid=27610: Mon Sep  9 15:34:24 2013
  read : io=14368KB, bw=489970B/s, iops=14, runt= 30028msec
    clat (usec): min=249, max=965747, avg=66820.27, stdev=130522.54
     lat (usec): min=250, max=965748, avg=66820.56, stdev=130522.55
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[ 2672], 10.00th=[ 3312], 20.00th=[ 4384],
     | 30.00th=[ 5472], 40.00th=[ 7136], 50.00th=[ 9920], 60.00th=[25216],
     | 70.00th=[46336], 80.00th=[101888], 90.00th=[187392], 95.00th=[313344],
     | 99.00th=[667648], 99.50th=[831488], 99.90th=[962560], 99.95th=[962560],
     | 99.99th=[962560]
    bw (KB  /s): min=   47, max= 1420, per=3.52%, avg=522.35, stdev=369.20
    lat (usec) : 250=0.22%, 500=1.78%, 1000=0.89%
    lat (msec) : 2=0.22%, 4=13.81%, 10=33.18%, 20=7.57%, 50=12.69%
    lat (msec) : 100=9.13%, 250=14.48%, 500=3.56%, 750=1.78%, 1000=0.67%
  cpu          : usr=0.00%, sys=0.09%, ctx=476, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=449/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27611: Mon Sep  9 15:34:24 2013
  read : io=40896KB, bw=1363.2KB/s, iops=42, runt= 30002msec
    clat (usec): min=240, max=1125.7K, avg=23452.98, stdev=42303.42
     lat (usec): min=241, max=1125.7K, avg=23453.24, stdev=42303.41
    clat percentiles (usec):
     |  1.00th=[  358],  5.00th=[ 2768], 10.00th=[ 3760], 20.00th=[ 5728],
     | 30.00th=[ 7584], 40.00th=[ 9280], 50.00th=[11840], 60.00th=[16512],
     | 70.00th=[22400], 80.00th=[31360], 90.00th=[55040], 95.00th=[82432],
     | 99.00th=[142336], 99.50th=[177152], 99.90th=[346112], 99.95th=[1122304],
     | 99.99th=[1122304]
    bw (KB  /s): min=  146, max= 3104, per=9.43%, avg=1398.29, stdev=558.12
    lat (usec) : 250=0.16%, 500=1.56%, 1000=0.23%
    lat (msec) : 2=0.39%, 4=8.69%, 10=33.02%, 20=22.61%, 50=21.99%
    lat (msec) : 100=8.29%, 250=2.90%, 500=0.08%, 2000=0.08%
  cpu          : usr=0.03%, sys=0.23%, ctx=1307, majf=1, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1278/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27612: Mon Sep  9 15:34:24 2013
  read : io=46848KB, bw=1561.3KB/s, iops=48, runt= 30011msec
    clat (usec): min=286, max=941235, avg=20479.21, stdev=33109.05
     lat (usec): min=286, max=941235, avg=20479.45, stdev=33109.06
    clat percentiles (usec):
     |  1.00th=[  346],  5.00th=[ 2832], 10.00th=[ 3728], 20.00th=[ 5344],
     | 30.00th=[ 7008], 40.00th=[ 8768], 50.00th=[10560], 60.00th=[14656],
     | 70.00th=[21376], 80.00th=[31616], 90.00th=[47360], 95.00th=[64256],
     | 99.00th=[114176], 99.50th=[126464], 99.90th=[216064], 99.95th=[937984],
     | 99.99th=[937984]
    bw (KB  /s): min=   34, max= 2603, per=10.68%, avg=1583.25, stdev=522.71
    lat (usec) : 500=1.37%, 750=0.27%, 1000=0.41%
    lat (msec) : 2=0.55%, 4=9.22%, 10=35.38%, 20=21.38%, 50=22.34%
    lat (msec) : 100=7.58%, 250=1.43%, 1000=0.07%
  cpu          : usr=0.03%, sys=0.27%, ctx=1496, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1464/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27613: Mon Sep  9 15:34:24 2013
  read : io=49184KB, bw=1639.9KB/s, iops=51, runt= 30007msec
    clat (usec): min=283, max=1102.9K, avg=19503.21, stdev=34881.14
     lat (usec): min=283, max=1102.9K, avg=19503.49, stdev=34881.16
    clat percentiles (usec):
     |  1.00th=[  358],  5.00th=[ 2704], 10.00th=[ 3568], 20.00th=[ 5408],
     | 30.00th=[ 7008], 40.00th=[ 8512], 50.00th=[10432], 60.00th=[14656],
     | 70.00th=[19328], 80.00th=[27008], 90.00th=[44288], 95.00th=[60672],
     | 99.00th=[101888], 99.50th=[124416], 99.90th=[187392], 99.95th=[1105920],
     | 99.99th=[1105920]
    bw (KB  /s): min=   57, max= 3088, per=11.24%, avg=1666.79, stdev=539.23
    lat (usec) : 500=1.63%, 750=0.20%, 1000=0.46%
    lat (msec) : 2=0.85%, 4=8.65%, 10=36.30%, 20=22.64%, 50=21.01%
    lat (msec) : 100=7.16%, 250=1.04%, 2000=0.07%
  cpu          : usr=0.05%, sys=0.25%, ctx=1566, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1537/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27614: Mon Sep  9 15:34:24 2013
  read : io=51424KB, bw=1711.5KB/s, iops=53, runt= 30048msec
    clat (usec): min=284, max=188196, avg=18679.09, stdev=21122.50
     lat (usec): min=285, max=188196, avg=18679.35, stdev=21122.52
    clat percentiles (usec):
     |  1.00th=[  346],  5.00th=[ 2928], 10.00th=[ 3792], 20.00th=[ 5472],
     | 30.00th=[ 7008], 40.00th=[ 8768], 50.00th=[10816], 60.00th=[14272],
     | 70.00th=[19072], 80.00th=[26752], 90.00th=[44288], 95.00th=[59648],
     | 99.00th=[101888], 99.50th=[119296], 99.90th=[185344], 99.95th=[187392],
     | 99.99th=[187392]
    bw (KB  /s): min=  982, max= 3174, per=11.64%, avg=1726.18, stdev=547.93
    lat (usec) : 500=1.80%, 750=0.12%, 1000=0.19%
    lat (msec) : 2=0.68%, 4=8.59%, 10=34.72%, 20=25.33%, 50=20.60%
    lat (msec) : 100=6.78%, 250=1.18%
  cpu          : usr=0.05%, sys=0.27%, ctx=1637, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1607/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27615: Mon Sep  9 15:34:24 2013
  read : io=45184KB, bw=1505.3KB/s, iops=47, runt= 30018msec
    clat (usec): min=249, max=998858, avg=21237.91, stdev=34929.01
     lat (usec): min=249, max=998859, avg=21238.16, stdev=34929.02
    clat percentiles (usec):
     |  1.00th=[  402],  5.00th=[ 2928], 10.00th=[ 3824], 20.00th=[ 5792],
     | 30.00th=[ 7520], 40.00th=[ 9280], 50.00th=[11968], 60.00th=[15808],
     | 70.00th=[20864], 80.00th=[32128], 90.00th=[49408], 95.00th=[67072],
     | 99.00th=[110080], 99.50th=[117248], 99.90th=[250880], 99.95th=[995328],
     | 99.99th=[995328]
    bw (KB  /s): min=  158, max= 2960, per=10.47%, avg=1553.07, stdev=510.03
    lat (usec) : 250=0.07%, 500=1.13%, 750=0.14%, 1000=0.28%
    lat (msec) : 2=0.50%, 4=8.43%, 10=33.00%, 20=25.35%, 50=21.39%
    lat (msec) : 100=7.58%, 250=1.91%, 500=0.14%, 1000=0.07%
  cpu          : usr=0.00%, sys=0.28%, ctx=1442, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1412/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27616: Mon Sep  9 15:34:24 2013
  read : io=42048KB, bw=1400.6KB/s, iops=43, runt= 30023msec
    clat (usec): min=231, max=941272, avg=22825.93, stdev=36944.28
     lat (usec): min=231, max=941272, avg=22826.23, stdev=36944.28
    clat percentiles (usec):
     |  1.00th=[  764],  5.00th=[ 2768], 10.00th=[ 3792], 20.00th=[ 5856],
     | 30.00th=[ 7520], 40.00th=[ 9408], 50.00th=[11968], 60.00th=[16768],
     | 70.00th=[21376], 80.00th=[34048], 90.00th=[52480], 95.00th=[74240],
     | 99.00th=[130560], 99.50th=[156672], 99.90th=[257024], 99.95th=[937984],
     | 99.99th=[937984]
    bw (KB  /s): min=  549, max= 2107, per=9.61%, avg=1425.18, stdev=403.52
    lat (usec) : 250=0.15%, 500=0.68%, 750=0.15%, 1000=0.53%
    lat (msec) : 2=0.84%, 4=8.90%, 10=31.43%, 20=24.73%, 50=20.93%
    lat (msec) : 100=9.13%, 250=2.28%, 500=0.15%, 1000=0.08%
  cpu          : usr=0.04%, sys=0.23%, ctx=1344, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1314/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27617: Mon Sep  9 15:34:24 2013
  read : io=51616KB, bw=1720.4KB/s, iops=53, runt= 30004msec
    clat (usec): min=271, max=337694, avg=18582.58, stdev=21895.56
     lat (usec): min=271, max=337695, avg=18582.84, stdev=21895.56
    clat percentiles (usec):
     |  1.00th=[  414],  5.00th=[ 2832], 10.00th=[ 3664], 20.00th=[ 5536],
     | 30.00th=[ 7072], 40.00th=[ 8640], 50.00th=[11200], 60.00th=[15040],
     | 70.00th=[19328], 80.00th=[27008], 90.00th=[40704], 95.00th=[56064],
     | 99.00th=[102912], 99.50th=[126464], 99.90th=[228352], 99.95th=[337920],
     | 99.99th=[337920]
    bw (KB  /s): min=  433, max= 2903, per=11.65%, avg=1727.89, stdev=502.31
    lat (usec) : 500=1.12%, 750=0.19%, 1000=0.19%
    lat (msec) : 2=1.24%, 4=9.36%, 10=34.04%, 20=24.74%, 50=22.07%
    lat (msec) : 100=5.89%, 250=1.12%, 500=0.06%
  cpu          : usr=0.04%, sys=0.28%, ctx=1646, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1613/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27618: Mon Sep  9 15:34:24 2013
  read : io=54976KB, bw=1831.7KB/s, iops=57, runt= 30014msec
    clat (usec): min=282, max=1057.1K, avg=17452.38, stdev=32319.99
     lat (usec): min=282, max=1057.1K, avg=17452.64, stdev=32319.98
    clat percentiles (usec):
     |  1.00th=[  338],  5.00th=[ 2544], 10.00th=[ 3408], 20.00th=[ 5152],
     | 30.00th=[ 6880], 40.00th=[ 8384], 50.00th=[10560], 60.00th=[13504],
     | 70.00th=[17792], 80.00th=[23936], 90.00th=[35072], 95.00th=[54016],
     | 99.00th=[100864], 99.50th=[116224], 99.90th=[329728], 99.95th=[1056768],
     | 99.99th=[1056768]
    bw (KB  /s): min=  298, max= 3355, per=12.73%, avg=1887.00, stdev=662.64
    lat (usec) : 500=1.86%, 750=0.35%, 1000=0.58%
    lat (msec) : 2=0.76%, 4=9.90%, 10=33.70%, 20=27.76%, 50=18.80%
    lat (msec) : 100=5.24%, 250=0.87%, 500=0.12%, 2000=0.06%
  cpu          : usr=0.03%, sys=0.32%, ctx=1751, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1718/w=0/d=0, short=r=0/w=0/d=0
rand-readers: (groupid=0, jobs=1): err= 0: pid=27619: Mon Sep  9 15:34:24 2013
  read : io=49056KB, bw=1634.8KB/s, iops=51, runt= 30008msec
    clat (usec): min=293, max=1168.3K, avg=19555.11, stdev=38133.80
     lat (usec): min=293, max=1168.3K, avg=19555.38, stdev=38133.79
    clat percentiles (usec):
     |  1.00th=[  338],  5.00th=[ 2768], 10.00th=[ 3504], 20.00th=[ 5024],
     | 30.00th=[ 6432], 40.00th=[ 8032], 50.00th=[10048], 60.00th=[13504],
     | 70.00th=[18560], 80.00th=[27008], 90.00th=[43264], 95.00th=[63232],
     | 99.00th=[118272], 99.50th=[150528], 99.90th=[296960], 99.95th=[1171456],
     | 99.99th=[1171456]
    bw (KB  /s): min=  133, max= 3111, per=11.38%, avg=1687.75, stdev=666.76
    lat (usec) : 500=1.57%, 750=0.13%, 1000=0.46%
    lat (msec) : 2=0.98%, 4=10.63%, 10=35.81%, 20=22.44%, 50=19.90%
    lat (msec) : 100=6.52%, 250=1.37%, 500=0.13%, 2000=0.07%
  cpu          : usr=0.00%, sys=0.31%, ctx=1564, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1533/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=445600KB, aggrb=14829KB/s, minb=478KB/s, maxb=1831KB/s, mint=30002msec, maxt=30048msec

Disk stats (read/write):
    md0: ios=14192/82, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=7096/26, aggrmerge=0/1052, aggrticks=154638/91456, aggrin_queue=398470, aggrutil=99.75%
  sda: ios=6984/48, merge=0/1052, ticks=133812/156372, in_queue=340724, util=99.71%
  sdb: ios=7208/5, merge=0/1052, ticks=175464/26540, in_queue=456216, util=99.75%
Guest: